# Brewfile is a homebrew-specific DSL to specify "this is what I want installed
# with homebrew. It's not implicit. Brew doesn't manage it. It just sits here,
# until you run `brew bundle --file <this-file>`, telling brew to apply the
# stuff listed here.
# -----------------------------------------------------------------------------

# Taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# ---------- CLI / formulae ----------
brew "ack"
brew "azure-cli"
brew "bat"
brew "black"
brew "cmake"
brew "curl"
brew "entr"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go"
brew "httpie"
brew "jq"
brew "lsd"
brew "mongosh"
brew "neovim"
brew "node"
brew "powerlevel10k"
brew "prettier"
brew "redis"
brew "ripgrep"
brew "ruff"
brew "skhd"
brew "tmux"
brew "tree"
brew "twine"
brew "uv"
brew "yabai"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ---------- GUI apps / casks ----------
cask "alacritty"
cask "arc"
cask "chatgpt"
cask "chatgpt-atlas"
cask "docker"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "github"
cask "google-chrome"
cask "microsoft-teams"
cask "mongodb-compass"
cask "nordvpn"
cask "obs"
cask "obsidian"
cask "powershell"
cask "sf-symbols"
cask "spotify"
cask "via"
cask "visual-studio-code"
cask "zoom"
